app/Controllers/AkunStaff.php

    public function index()
    {
        $StaffModel = new StaffModel();
        $data['staff'] = $StaffModel->orderBy('id_staff', 'username', 'email', 'telepon', 'password')->findAll();
---
SELECT *
FROM `staff`
ORDER BY `id_staff`