app/Controllers/BarangMasuk.php

SELECT *
FROM `barang_masuk`
WHERE `barang_masuk`.`id_transaksi` = '19'
SELECT *
FROM `barang`
ORDER BY `id_barang`
SELECT *
FROM `ruang`
ORDER BY `id_ruang`
---
    public function edit($id_transaksi)
    {
        $BarangMasukModel = new BarangMasukModel();
        $BarangModel = new BarangModel();
        $RuangModel = new RuangModel();
        $data['barang_masuk'] = $BarangMasukModel->find($id_transaksi);
        $data['barang'] = $BarangModel->orderBy('id_barang', 'nama_barang', 'id_kategori')->findAll();
        $data['ruang'] = $RuangModel->orderBy('id_ruang', 'nama_ruang')->findAll();