app/Controllers/BarangKeluar.php

    public function delete($id_transaksi = null)
    {
        $BarangKeluarModel = new BarangKeluarModel();
        $data['barang_keluar'] = $BarangKeluarModel->where('id_transaksi', $id_transaksi)->delete($id_transaksi);
---
DELETE FROM `barang_keluar`
WHERE `id_transaksi` = '5'
AND `id_transaksi` IN ('5')