app/Controllers/Barang.php

SELECT `barang`.`nama_barang`, `kategori`.`nama_kategori`, (sum(barang_masuk.jumlah_barang) - sum(barang_keluar.jumlah_barang)) AS Jumlah, `ruang`.`nama_ruang`
FROM `barang_masuk`
JOIN `barang_keluar` ON `barang_masuk`.`id_barang` = `barang_keluar`.`id_barang`
JOIN `barang` ON `barang_masuk`.`id_barang` = `barang`.`id_barang`
JOIN `kategori` ON `barang`.`id_kategori` = `kategori`.`id_kategori`
JOIN `ruang` ON `barang_masuk`.`id_ruang` = `ruang`.`id_ruang`
GROUP BY `ruang`.`nama_ruang`, `barang`.`nama_barang`
---
    public function index()
    {
        $BarangMasukModel = new BarangMasukModel();
        $BarangMasukModel->builder();
        $hasil = $BarangMasukModel->builder()->select('barang.nama_barang, kategori.nama_kategori,
        (sum(barang_masuk.jumlah_barang) - sum(barang_keluar.jumlah_barang)div count(barang_masuk.id_transaksi)) AS Jumlah, ruang.nama_ruang')
            ->join('barang_keluar', 'barang_masuk.id_barang = barang_keluar.id_barang')
            ->join('barang', 'barang_masuk.id_barang = barang.id_barang')
            ->join('kategori', 'barang.id_kategori = kategori.id_kategori')
            ->join('ruang', 'barang_masuk.id_ruang = ruang.id_ruang')
            ->groupBy('barang.nama_barang, ruang.nama_ruang')
            ->get()->getResultArray();