app/Controllers/Home.php

SELECT *
FROM `bar_masuk`
ORDER BY `id_barang`
---
    public function index()
    {
        // $label = "";
        // $jumlah = "";

        $BarMasukModel = new BarMasukModel();
        $data['barmasuk'] = $BarMasukModel->orderBy('id_barang', 'jum')->findAll();