app/Controllers/Home.php

    public function index()
    {
        // $label = "";
        // $jumlah = "";
        $BarangMasukModel = new BarangMasukModel();
        $BarangKeluarModel = new BarangKeluarModel();
        $result = $BarangMasukModel->builder()->select('nama_barang, SUM(jumlah_barang) as jumlah')->join('barang', 'barang_masuk.id_barang = barang.id_barang')->groupBy('barang_masuk.id_barang')->orderBy('jumlah', 'DESC')->get(5)->getResultArray();
        $data['barmasuk'] = $result;
        $data['barkeluar'] =  $BarangKeluarModel->builder()->select('nama_barang, SUM(jumlah_barang) as jumlah')->join('barang', 'barang_keluar.id_barang = barang.id_barang')->groupBy('barang_keluar.id_barang')->orderBy('jumlah', 'DESC')->get(5)->getResultArray();
        $data['barangmasuk'] = $BarangMasukModel->builder()->select('SUM(jumlah_barang) as j')->get()->getRowArray()['j'];
        $data['barangkeluar'] = $BarangKeluarModel->builder()->select('SUM(jumlah_barang) as j')->get()->getRowArray()['j'];
        $data['frekuensi'] = $BarangMasukModel->builder()->select('MONTH(tanggal_masuk) AS bulan, SUM(jumlah_barang) AS jumlah')->where('YEAR(tanggal_masuk) = YEAR(NOW())')->groupBy('bulan')->get()->getResultArray();
---
SELECT `nama_barang`, SUM(jumlah_barang) as jumlah
FROM `barang_masuk`
JOIN `barang` ON `barang_masuk`.`id_barang` = `barang`.`id_barang`
GROUP BY `barang_masuk`.`id_barang`
ORDER BY `jumlah` DESC
 LIMIT 5
SELECT `nama_barang`, SUM(jumlah_barang) as jumlah
FROM `barang_keluar`
JOIN `barang` ON `barang_keluar`.`id_barang` = `barang`.`id_barang`
GROUP BY `barang_keluar`.`id_barang`
ORDER BY `jumlah` DESC
 LIMIT 5
SELECT SUM(jumlah_barang) as j
FROM `barang_masuk`
SELECT SUM(jumlah_barang) as j
FROM `barang_keluar`
SELECT MONTH(tanggal_masuk) AS bulan, SUM(jumlah_barang) AS jumlah
FROM `barang_masuk`
WHERE YEAR(tanggal_masuk) = YEAR(NOW())
GROUP BY `bulan`