app/Controllers/JenisBarang.php

    public function index()
    {
        $db = \Config\Database::connect();
        $sql = "SELECT B.id_barang, B.nama_barang, IF(K.nama_kategori IS NULL, 'Tidak ada', K.nama_kategori) as nama_kategori,
        B.jumlah_minimal
        FROM barang B
        LEFT JOIN kategori K
        ON B.id_kategori = K.id_kategori;";
        $q = $db->query($sql);
        $hasil = $q->getResultArray();

        $data['barang'] = $hasil;

        // kategori
        $KategoriModel = new KategoriModel();
        $data['kategori'] = $KategoriModel->orderBy('id_kategori', 'nama_kategori')->findAll();
---
SELECT *
FROM `kategori`
ORDER BY `id_kategori`

    public function tambah()
    {
        $KategoriModel = new KategoriModel();
        $data['validation'] = \Config\Services::validation();
        $data['kategori'] = $KategoriModel->orderBy('id_kategori', 'nama_kategori')->findAll();
---
SELECT *
FROM `kategori`
ORDER BY `id_kategori`

    public function store()
    {
        // validasi input
        if (!$this->validate([
            'nama_barang' => ['label' => 'nama barang', 'rules' => 'required'],
            'id_kategori' => ['label' => 'nama kategori', 'rules' => 'required']
        ])) {
            // $validation = $this->validator;
            $KategoriModel = new KategoriModel();
            $data['kategori'] = $KategoriModel->orderBy('id_kategori', 'nama_kategori')->findAll();
            $data['validation'] = $this->validator;
            return view('templates/tambah-jenis-barang', $data);
        }

        $BarangModel = new BarangModel();
        $data = [
            'nama_barang' => $this->request->getVar('nama_barang'),
            'id_kategori' => $this->request->getVar('id_kategori')
        ];

        $BarangModel->insert($data);
---
INSERT INTO `barang` (`nama_barang`, `id_kategori`, `jumlah_minimal`) VALUES ('barang35', '25', '0')