app/Controllers/Kategori.php

SELECT *
FROM `kategori`
ORDER BY `id_kategori`
---
    public function index()
    {
        $KategoriModel = new KategoriModel();
        $data['kategori'] = $KategoriModel->orderBy('id_kategori', 'nama_kategori')->findAll();