app/Controllers/PengaturanAkun.php

SELECT *
FROM `users`
ORDER BY `id_user`
---
    public function index()
    {
        $AkunModel = new ModelLogin();
        $data['admin'] = $AkunModel->orderBy('id_user', 'username', 'email', 'telepon', 'password')->findAll();