app/Controllers/Ruang.php

SELECT *
FROM `ruang`
ORDER BY `id_ruang`
---
    public function index()
    {
        // return view('templates/ruang');
        $RuangModel = new RuangModel();
        $data['ruang'] = $RuangModel->orderBy('id_ruang', 'DESC')->findAll();

SELECT *
FROM `ruang`
WHERE `id_ruang` = '4'
 LIMIT 1
---
    public function edit($id_ruang)
    {
        $RuangModel = new RuangModel();
        $data['validation'] = \Config\Services::validation();
        $data['ruang'] = $RuangModel->where('id_ruang', $id_ruang)->first();